app/controllers/tours_controller.rb

  def create
    @tour = Tour.new(tour_params)

    respond_to do |format|
      if @tour.save
---
INSERT INTO "tours" ("title", "short_description", "has_many_day", "has_many_night", "season", "place", "place_info", "description", "min_group_count", "max_group_count", "price", "mark", "image_title", "image_uid", "included_services", "not_included_services", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @tour.destroy
---
DELETE FROM "tours" WHERE "tours"."id" = ?  [["id", 980190962]]

    def set_tour
      @tour = Tour.find(params[:id])
---
SELECT  "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT 1  [["id", 980190962]]